Can't regenerate Family [Family Name]. Edit Family to modify it.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotRegenFamily { get; }
  Visual Basic
Public Shared ReadOnly Property CannotRegenFamily As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotRegenFamily {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RegenFailures Class
  Autodesk.Revit.DB Namespace